; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v2 - type_3 ?v8 - type_2)
 	      (pred_2 ?v3 - object ?v8 - type_2)
	      (pred_1 ?v2 - type_3 ?v4 - type_1)
	      (pred_4 ?v2 - type_3 ?v3 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v2 - type_3 ?v6 ?v1 - type_2)
       :precondition (and  (pred_3 ?v2 ?v6))
       :effect (and  (pred_3 ?v2 ?v1)
		     (not (pred_3 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_3 ?v5 - object ?v7 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v7) (pred_3 ?v2 ?v7) (pred_1 ?v2 ?v4))
       :effect (and (pred_4 ?v2 ?v5 ?v4)
		    (not (pred_2 ?v5 ?v7)) 
		    (not (pred_1 ?v2 ?v4))))

   (:action op_1
       :parameters (?v2 - type_3 ?v5 - object ?v7 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v2 ?v5 ?v4) (pred_3 ?v2 ?v7))
       :effect (and (pred_2 ?v5 ?v7)
		    (pred_1 ?v2 ?v4)
		    (not (pred_4 ?v2 ?v5 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_01 - type_3
obj_13 obj_02 obj_04 obj_14 - type_1
obj_05 obj_03 obj_10 obj_08 - type_2
obj_06 obj_07 obj_12 obj_09 - object)
(:init
(pred_3 obj_11 obj_08)
(pred_1 obj_11 obj_13)
(pred_1 obj_11 obj_02)
(pred_3 obj_01 obj_10)
(pred_1 obj_01 obj_04)
(pred_1 obj_01 obj_14)
(pred_2 obj_06 obj_08)
(pred_2 obj_07 obj_03)
(pred_2 obj_12 obj_10)
(pred_2 obj_09 obj_03)
)
(:goal
(and
(pred_2 obj_06 obj_10)
(pred_2 obj_07 obj_03)
(pred_2 obj_12 obj_05)
(pred_2 obj_09 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_11 obj_10)))
)
)

; plan
1. (op_2 obj_11 obj_06 obj_08 obj_02)
   deleted: (pred_2 obj_06 obj_08) (pred_1 obj_11 obj_02)
   added: (pred_4 obj_11 obj_06 obj_02)
   goals met: 1 of 4
2. (op_2 obj_01 obj_12 obj_10 obj_14)
   deleted: (pred_2 obj_12 obj_10) (pred_1 obj_01 obj_14)
   added: (pred_4 obj_01 obj_12 obj_14)
   goals met: 1 of 4
3. (op_3 obj_01 obj_10 obj_05)
   deleted: (pred_3 obj_01 obj_10)
   added: (pred_3 obj_01 obj_05)
   goals met: 1 of 4
4. (op_3 obj_11 obj_08 obj_03)
   deleted: (pred_3 obj_11 obj_08)
   added: (pred_3 obj_11 obj_03)
   goals met: 1 of 4
5. (op_1 obj_01 obj_12 obj_05 obj_14)
   deleted: (pred_4 obj_01 obj_12 obj_14)
   added: (pred_2 obj_12 obj_05) (pred_1 obj_01 obj_14)
   goals met: 2 of 4
6. (op_1 obj_11 obj_06 obj_03 obj_02)
   deleted: (pred_4 obj_11 obj_06 obj_02)
   added: (pred_2 obj_06 obj_03) (pred_1 obj_11 obj_02)
   goals met: 2 of 4
7. (op_3 obj_01 obj_05 obj_03)
   deleted: (pred_3 obj_01 obj_05)
   added: (pred_3 obj_01 obj_03)
   goals met: 2 of 4
8. (op_2 obj_01 obj_09 obj_03 obj_14)
   deleted: (pred_2 obj_09 obj_03) (pred_1 obj_01 obj_14)
   added: (pred_4 obj_01 obj_09 obj_14)
   goals met: 2 of 4
9. (op_3 obj_01 obj_03 obj_10)
   deleted: (pred_3 obj_01 obj_03)
   added: (pred_3 obj_01 obj_10)
   goals met: 2 of 4
10. (op_1 obj_01 obj_09 obj_10 obj_14)
   deleted: (pred_4 obj_01 obj_09 obj_14)
   added: (pred_2 obj_09 obj_10) (pred_1 obj_01 obj_14)
   goals met: 3 of 4
11. (op_3 obj_01 obj_10 obj_03)
   deleted: (pred_3 obj_01 obj_10)
   added: (pred_3 obj_01 obj_03)
   goals met: 3 of 4
12. (op_2 obj_01 obj_06 obj_03 obj_14)
   deleted: (pred_2 obj_06 obj_03) (pred_1 obj_01 obj_14)
   added: (pred_4 obj_01 obj_06 obj_14)
   goals met: 3 of 4
13. (op_3 obj_01 obj_03 obj_10)
   deleted: (pred_3 obj_01 obj_03)
   added: (pred_3 obj_01 obj_10)
   goals met: 3 of 4
14. (op_1 obj_01 obj_06 obj_10 obj_14)
   deleted: (pred_4 obj_01 obj_06 obj_14)
   added: (pred_2 obj_06 obj_10) (pred_1 obj_01 obj_14)
   goals met: 4 of 4
